fjpolo/TM4C123_SPI_SDCard/cmsisboot/startup/startup_Cortex_M4.c
/**
 ******************************************************************************
 * @file      startup_tm4c.c
 * @author    Coocox
 * @version   V1.0
 * @date      12/23/2009
 * @brief     tm4c Devices Startup code.
 *            This module performs:
 *                - Set the initial SP
 *                - Set the vector table entries with the exceptions ISR address
 *                - Initialize data and bss
 *                - Setup the microcontroller system.
 *                - Call the application's entry point.
 *            After Reset the Cortex-M4F processor is in Thread mode,
 *            priority is Privileged, and the Stack is set to Main.
 *******************************************************************************
 */

#include <stdint.h>
#include "inc/hw_nvic.h"
#include "inc/hw_types.h"


/*----------Stack Configuration-----------------------------------------------*/
#define STACK_SIZE       0x00000200      /*!< The Stack size suggest using even number     */
__attribute__ ((section(".co_stack")))
unsigned long pulStack[STACK_SIZE];


/*----------Macro definition--------------------------------------------------*/
#define WEAK __attribute__ ((weak))


/*----------Declaration of the default fault handlers-------------------------*/
/* System exception vector handler */
__attribute__ ((used))
void WEAK  Reset_Handler(void);
void WEAK  NMI_Handler(void);
void WEAK  HardFault_Handler(void);
void WEAK  MemManage_Handler(void);
void WEAK  BusFault_Handler(void);
void WEAK  UsageFault_Handler(void);
void WEAK  SVC_Handler(void);
void WEAK  DebugMon_Handler(void);
void WEAK  PendSV_Handler(void);
void WEAK  SysTick_Handler(void);
void WEAK  GPIOPortA_IRQHandler(void);
void WEAK  GPIOPortB_IRQHandler(void);
void WEAK  GPIOPortC_IRQHandler(void);
void WEAK  GPIOPortD_IRQHandler(void);
void WEAK  GPIOPortE_IRQHandler(void);
void WEAK  UART0_IRQHandler(void);
void WEAK  UART1_IRQHandler(void);
void WEAK  SSI0_IRQHandler(void);
void WEAK  I2C0_IRQHandler(void);
void WEAK  PWMFault_IRQHandler(void);
void WEAK  PWMGen0_IRQHandler(void);
void WEAK  PWMGen1_IRQHandler(void);
void WEAK  PWMGen2_IRQHandler(void);
void WEAK  QEI0_IRQHandler(void);
void WEAK  ADCSeq0_IRQHandler(void);
void WEAK  ADCSeq1_IRQHandler(void);
void WEAK  ADCSeq2_IRQHandler(void);
void WEAK  ADCSeq3_IRQHandler(void);
void WEAK  Watchdog_IRQHandler(void);
void WEAK  Timer0A_IRQHandler(void);
void WEAK  Timer0B_IRQHandler(void);
void WEAK  Timer1A_IRQHandler(void);
void WEAK  Timer1B_IRQHandler(void);
void WEAK  Timer2A_IRQHandler(void);
void WEAK  Timer2B_IRQHandler(void);
void WEAK  Comp0_IRQHandler(void);
void WEAK  Comp1_IRQHandler(void);
void WEAK  Comp2_IRQHandler(void);
void WEAK  SysCtrl_IRQHandler(void);
void WEAK  FlashCtrl_IRQHandler(void);
void WEAK  GPIOPortF_IRQHandler(void);
void WEAK  GPIOPortG_IRQHandler(void);
void WEAK  GPIOPortH_IRQHandler(void);
void WEAK  UART2_IRQHandler(void);
void WEAK  SSI1_IRQHandler(void);
void WEAK  Timer3A_IRQHandler(void);
void WEAK  Timer3B_IRQHandler(void);
void WEAK  I2C1_IRQHandler(void);
void WEAK  QEI1_IRQHandler(void);
void WEAK  CAN0_IRQHandler(void);
void WEAK  CAN1_IRQHandler(void);
void WEAK  CAN2_IRQHandler(void);
void WEAK  Hibernate_IRQHandler(void);
void WEAK  USB0_IRQHandler(void);
void WEAK  PWMGen3_IRQHandler(void);
void WEAK  uDMA_IRQHandler(void);
void WEAK  uDMAErr_IRQHandler(void);
void WEAK  ADC1Seq0_IRQHandler(void);
void WEAK  ADC1Seq1_IRQHandler(void);
void WEAK  ADC1Seq2_IRQHandler(void);
void WEAK  ADC1Seq3_IRQHandler(void);
void WEAK  GPIOPortJ_IRQHandler(void);
void WEAK  GPIOPortK_IRQHandler(void);
void WEAK  GPIOPortL_IRQHandler(void);
void WEAK  SSI2_IRQHandler(void);
void WEAK  SSI3_IRQHandler(void);
void WEAK  UART3_IRQHandler(void);
void WEAK  UART4_IRQHandler(void);
void WEAK  UART5_IRQHandler(void);
void WEAK  UART6_IRQHandler(void);
void WEAK  UART7_IRQHandler(void);
void WEAK  I2C2_IRQHandler(void);
void WEAK  I2C3_IRQHandler(void);
void WEAK  Timer4A_IRQHandler(void);
void WEAK  Timer4B_IRQHandler(void);
void WEAK  Timer5A_IRQHandler(void);
void WEAK  Timer5B_IRQHandler(void);
void WEAK  WTimer0A_IRQHandler(void);
void WEAK  WTimer0B_IRQHandler(void);
void WEAK  WTimer1A_IRQHandler(void);
void WEAK  WTimer1B_IRQHandler(void);
void WEAK  WTimer2A_IRQHandler(void);
void WEAK  WTimer2B_IRQHandler(void);
void WEAK  WTimer3A_IRQHandler(void);
void WEAK  WTimer3B_IRQHandler(void);
void WEAK  WTimer4A_IRQHandler(void);
void WEAK  WTimer4B_IRQHandler(void);
void WEAK  WTimer5A_IRQHandler(void);
void WEAK  WTimer5B_IRQHandler(void);
void WEAK  FPU_IRQHandler(void);
void WEAK  PECI0_IRQHandler(void);
void WEAK  LPC0_IRQHandler(void);
void WEAK  I2C4_IRQHandler(void);
void WEAK  I2C5_IRQHandler(void);
void WEAK  GPIOPortM_IRQHandler(void);
void WEAK  GPIOPortN_IRQHandler(void);
void WEAK  QEI2_IRQHandler(void);
void WEAK  Fan0_IRQHandler(void);
void WEAK  GPIOPortP0_IRQHandler(void);
void WEAK  GPIOPortP1_IRQHandler(void);
void WEAK  GPIOPortP2_IRQHandler(void);
void WEAK  GPIOPortP3_IRQHandler(void);
void WEAK  GPIOPortP4_IRQHandler(void);
void WEAK  GPIOPortP5_IRQHandler(void);
void WEAK  GPIOPortP6_IRQHandler(void);
void WEAK  GPIOPortP7_IRQHandler(void);
void WEAK  GPIOPortQ0_IRQHandler(void);
void WEAK  GPIOPortQ1_IRQHandler(void);
void WEAK  GPIOPortQ2_IRQHandler(void);
void WEAK  GPIOPortQ3_IRQHandler(void);
void WEAK  GPIOPortQ4_IRQHandler(void);
void WEAK  GPIOPortQ5_IRQHandler(void);
void WEAK  GPIOPortQ6_IRQHandler(void);
void WEAK  GPIOPortQ7_IRQHandler(void);
void WEAK  GPIOPortR_IRQHandler(void);
void WEAK  GPIOPortS_IRQHandler(void);
void WEAK  PWM1Gen0_IRQHandler(void);
void WEAK  PWM1Gen1_IRQHandler(void);
void WEAK  PWM1Gen2_IRQHandler(void);
void WEAK  PWM1Gen3_IRQHandler(void);
void WEAK  PWM1Fault_IRQHandler(void);


/*----------Symbols defined in linker script----------------------------------*/
extern unsigned long _sidata;    /*!< Start address for the initialization
                                      values of the .data section.            */
extern unsigned long _sdata;     /*!< Start address for the .data section     */
extern unsigned long _edata;     /*!< End address for the .data section       */
extern unsigned long _sbss;      /*!< Start address for the .bss section      */
extern unsigned long _ebss;      /*!< End address for the .bss section        */
extern void _eram;               /*!< End address for ram                     */


