fjpolo/TM4C123_SPI_SDCard/cmsisboot/startup/startup_Cortex_M4.c
  /* Call the application's entry point.*/
  main();
}


/**
  *@brief Provide weak aliases for each Exception handler to the Default_Handler.
  *       As they are weak aliases, any function with the same name will override
  *       this definition.
  */

#pragma weak Reset_Handler = Default_Reset_Handler
#pragma weak NMI_Handler = Default_Handler
#pragma weak HardFault_Handler = Default_Handler
#pragma weak MemManage_Handler = Default_Handler
#pragma weak BusFault_Handler = Default_Handler
#pragma weak UsageFault_Handler = Default_Handler
#pragma weak SVC_Handler = Default_Handler
#pragma weak DebugMon_Handler = Default_Handler
#pragma weak PendSV_Handler = Default_Handler
#pragma weak SysTick_Handler = Default_Handler
#pragma weak GPIOPortA_IRQHandler = Default_Handler
#pragma weak GPIOPortB_IRQHandler = Default_Handler
#pragma weak GPIOPortC_IRQHandler = Default_Handler
#pragma weak GPIOPortD_IRQHandler = Default_Handler
#pragma weak GPIOPortE_IRQHandler = Default_Handler
#pragma weak UART0_IRQHandler = Default_Handler
#pragma weak UART1_IRQHandler = Default_Handler
#pragma weak SSI0_IRQHandler = Default_Handler
#pragma weak I2C0_IRQHandler = Default_Handler
#pragma weak PWMFault_IRQHandler = Default_Handler
#pragma weak PWMGen0_IRQHandler = Default_Handler
#pragma weak PWMGen1_IRQHandler = Default_Handler
#pragma weak PWMGen2_IRQHandler = Default_Handler
#pragma weak QEI0_IRQHandler = Default_Handler
#pragma weak ADCSeq0_IRQHandler = Default_Handler
#pragma weak ADCSeq1_IRQHandler = Default_Handler
#pragma weak ADCSeq2_IRQHandler = Default_Handler
#pragma weak ADCSeq3_IRQHandler = Default_Handler
#pragma weak Watchdog_IRQHandler = Default_Handler
#pragma weak Timer0A_IRQHandler = Default_Handler
#pragma weak Timer0B_IRQHandler = Default_Handler
#pragma weak Timer1A_IRQHandler = Default_Handler
#pragma weak Timer1B_IRQHandler = Default_Handler
#pragma weak Timer2A_IRQHandler = Default_Handler
#pragma weak Timer2B_IRQHandler = Default_Handler
#pragma weak Comp0_IRQHandler = Default_Handler
#pragma weak Comp1_IRQHandler = Default_Handler
#pragma weak Comp2_IRQHandler = Default_Handler
#pragma weak SysCtrl_IRQHandler = Default_Handler
#pragma weak FlashCtrl_IRQHandler = Default_Handler
#pragma weak GPIOPortF_IRQHandler = Default_Handler
#pragma weak GPIOPortG_IRQHandler = Default_Handler
#pragma weak GPIOPortH_IRQHandler = Default_Handler
#pragma weak UART2_IRQHandler = Default_Handler
#pragma weak SSI1_IRQHandler = Default_Handler
#pragma weak Timer3A_IRQHandler = Default_Handler
#pragma weak Timer3B_IRQHandler = Default_Handler
#pragma weak I2C1_IRQHandler = Default_Handler
#pragma weak QEI1_IRQHandler = Default_Handler
#pragma weak CAN0_IRQHandler = Default_Handler
#pragma weak CAN1_IRQHandler = Default_Handler
#pragma weak CAN2_IRQHandler = Default_Handler
#pragma weak Hibernate_IRQHandler = Default_Handler
#pragma weak USB0_IRQHandler = Default_Handler
#pragma weak PWMGen3_IRQHandler = Default_Handler
#pragma weak uDMA_IRQHandler = Default_Handler
#pragma weak uDMAErr_IRQHandler = Default_Handler
#pragma weak  ADC1Seq0_IRQHandler = Default_Handler
#pragma weak  ADC1Seq1_IRQHandler = Default_Handler
#pragma weak  ADC1Seq2_IRQHandler = Default_Handler
#pragma weak  ADC1Seq3_IRQHandler = Default_Handler
#pragma weak  GPIOPortJ_IRQHandler = Default_Handler
#pragma weak  GPIOPortK_IRQHandler = Default_Handler
#pragma weak  GPIOPortL_IRQHandler = Default_Handler
#pragma weak  SSI2_IRQHandler = Default_Handler
#pragma weak  SSI3_IRQHandler = Default_Handler
#pragma weak  UART3_IRQHandler = Default_Handler
#pragma weak  UART4_IRQHandler = Default_Handler
#pragma weak  UART5_IRQHandler = Default_Handler
#pragma weak  UART6_IRQHandler = Default_Handler
#pragma weak  UART7_IRQHandler = Default_Handler
#pragma weak  I2C2_IRQHandler = Default_Handler
#pragma weak  I2C3_IRQHandler = Default_Handler
#pragma weak  Timer4A_IRQHandler = Default_Handler
#pragma weak  Timer4B_IRQHandler = Default_Handler
#pragma weak  Timer5A_IRQHandler = Default_Handler
#pragma weak  Timer5B_IRQHandler = Default_Handler
#pragma weak  WTimer0A_IRQHandler = Default_Handler
#pragma weak  WTimer0B_IRQHandler = Default_Handler
#pragma weak  WTimer1A_IRQHandler = Default_Handler
#pragma weak  WTimer1B_IRQHandler = Default_Handler
#pragma weak  WTimer2A_IRQHandler = Default_Handler
#pragma weak  WTimer2B_IRQHandler = Default_Handler
#pragma weak  WTimer3A_IRQHandler = Default_Handler
#pragma weak  WTimer3B_IRQHandler = Default_Handler
#pragma weak  WTimer4A_IRQHandler = Default_Handler
#pragma weak  WTimer4B_IRQHandler = Default_Handler
#pragma weak  WTimer5A_IRQHandler = Default_Handler
#pragma weak  WTimer5B_IRQHandler = Default_Handler
#pragma weak  FPU_IRQHandler = Default_Handler
#pragma weak  PECI0_IRQHandler = Default_Handler
#pragma weak  LPC0_IRQHandler = Default_Handler
#pragma weak  I2C4_IRQHandler = Default_Handler
#pragma weak  I2C5_IRQHandler = Default_Handler
#pragma weak  GPIOPortM_IRQHandler = Default_Handler
#pragma weak  GPIOPortN_IRQHandler = Default_Handler
#pragma weak  QEI2_IRQHandler = Default_Handler
#pragma weak  Fan0_IRQHandler = Default_Handler
#pragma weak  GPIOPortP0_IRQHandler = Default_Handler
#pragma weak  GPIOPortP1_IRQHandler = Default_Handler
#pragma weak  GPIOPortP2_IRQHandler = Default_Handler
#pragma weak  GPIOPortP3_IRQHandler = Default_Handler
#pragma weak  GPIOPortP4_IRQHandler = Default_Handler
#pragma weak  GPIOPortP5_IRQHandler = Default_Handler
#pragma weak  GPIOPortP6_IRQHandler = Default_Handler
#pragma weak  GPIOPortP7_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ0_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ1_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ2_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ3_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ4_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ5_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ6_IRQHandler = Default_Handler
#pragma weak  GPIOPortQ7_IRQHandler = Default_Handler
#pragma weak  GPIOPortR_IRQHandler = Default_Handler
#pragma weak  GPIOPortS_IRQHandler = Default_Handler
#pragma weak  PWM1Gen0_IRQHandler = Default_Handler
#pragma weak  PWM1Gen1_IRQHandler = Default_Handler
#pragma weak  PWM1Gen2_IRQHandler = Default_Handler
#pragma weak  PWM1Gen3_IRQHandler = Default_Handler
#pragma weak  PWM1Fault_IRQHandler = Default_Handler


/**
  * @brief  This is the code that gets called when the processor receives an
  *         unexpected interrupt.  This simply enters an infinite loop,
  *         preserving the system state for examination by a debugger.
  * @param  None
  * @retval None
  */
static void Default_Handler(void)
{
  /* Go into an infinite loop. */
  while (1)
  {
  }
}

/*********************** (C) COPYRIGHT 2009 Coocox ************END OF FILE*****/
